MikroElektronika/core_packages/PIC/XC8/def/PIC18F83J90/mcu.h
// Register: SPBRG2
#define SPBRG2 SPBRG2
extern volatile unsigned char           SPBRG2              __at(0xF64);
#ifndef _LIB_BUILD
asm("SPBRG2 equ 0F64h");
#endif

// Register: CCP2CON
#define CCP2CON CCP2CON
extern volatile unsigned char           CCP2CON             __at(0xF65);
#ifndef _LIB_BUILD
asm("CCP2CON equ 0F65h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP2M                  :4;
        unsigned DC2B                   :2;
    };
    struct {
        unsigned CCP2M0                 :1;
        unsigned CCP2M1                 :1;
        unsigned CCP2M2                 :1;
        unsigned CCP2M3                 :1;
        unsigned DC2B0                  :1;
        unsigned DC2B1                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned DCCP2Y                 :1;
        unsigned DCCP2X                 :1;
    };
} CCP2CONbits_t;
extern volatile CCP2CONbits_t CCP2CONbits __at(0xF65);
// bitfield macros
#define _CCP2CON_CCP2M_POSN                                 0x0
#define _CCP2CON_CCP2M_POSITION                             0x0
#define _CCP2CON_CCP2M_SIZE                                 0x4
#define _CCP2CON_CCP2M_LENGTH                               0x4
#define _CCP2CON_CCP2M_MASK                                 0xF
#define _CCP2CON_DC2B_POSN                                  0x4
#define _CCP2CON_DC2B_POSITION                              0x4
#define _CCP2CON_DC2B_SIZE                                  0x2
#define _CCP2CON_DC2B_LENGTH                                0x2
#define _CCP2CON_DC2B_MASK                                  0x30
#define _CCP2CON_CCP2M0_POSN                                0x0
#define _CCP2CON_CCP2M0_POSITION                            0x0
#define _CCP2CON_CCP2M0_SIZE                                0x1
#define _CCP2CON_CCP2M0_LENGTH                              0x1
#define _CCP2CON_CCP2M0_MASK                                0x1
#define _CCP2CON_CCP2M1_POSN                                0x1
#define _CCP2CON_CCP2M1_POSITION                            0x1
#define _CCP2CON_CCP2M1_SIZE                                0x1
#define _CCP2CON_CCP2M1_LENGTH                              0x1
#define _CCP2CON_CCP2M1_MASK                                0x2
#define _CCP2CON_CCP2M2_POSN                                0x2
#define _CCP2CON_CCP2M2_POSITION                            0x2
#define _CCP2CON_CCP2M2_SIZE                                0x1
#define _CCP2CON_CCP2M2_LENGTH                              0x1
#define _CCP2CON_CCP2M2_MASK                                0x4
#define _CCP2CON_CCP2M3_POSN                                0x3
#define _CCP2CON_CCP2M3_POSITION                            0x3
#define _CCP2CON_CCP2M3_SIZE                                0x1
#define _CCP2CON_CCP2M3_LENGTH                              0x1
#define _CCP2CON_CCP2M3_MASK                                0x8
#define _CCP2CON_DC2B0_POSN                                 0x4
#define _CCP2CON_DC2B0_POSITION                             0x4
#define _CCP2CON_DC2B0_SIZE                                 0x1
#define _CCP2CON_DC2B0_LENGTH                               0x1
#define _CCP2CON_DC2B0_MASK                                 0x10
#define _CCP2CON_DC2B1_POSN                                 0x5
#define _CCP2CON_DC2B1_POSITION                             0x5
#define _CCP2CON_DC2B1_SIZE                                 0x1
#define _CCP2CON_DC2B1_LENGTH                               0x1
#define _CCP2CON_DC2B1_MASK                                 0x20
#define _CCP2CON_DCCP2Y_POSN                                0x4
#define _CCP2CON_DCCP2Y_POSITION                            0x4
#define _CCP2CON_DCCP2Y_SIZE                                0x1
#define _CCP2CON_DCCP2Y_LENGTH                              0x1
#define _CCP2CON_DCCP2Y_MASK                                0x10
#define _CCP2CON_DCCP2X_POSN                                0x5
#define _CCP2CON_DCCP2X_POSITION                            0x5
#define _CCP2CON_DCCP2X_SIZE                                0x1
#define _CCP2CON_DCCP2X_LENGTH                              0x1
#define _CCP2CON_DCCP2X_MASK                                0x20

// Register: CCPR2
#define CCPR2 CCPR2
extern volatile unsigned short          CCPR2               __at(0xF66);
#ifndef _LIB_BUILD
asm("CCPR2 equ 0F66h");
#endif

// Register: CCPR2L
#define CCPR2L CCPR2L
extern volatile unsigned char           CCPR2L              __at(0xF66);
#ifndef _LIB_BUILD
asm("CCPR2L equ 0F66h");
#endif

// Register: CCPR2H
#define CCPR2H CCPR2H
extern volatile unsigned char           CCPR2H              __at(0xF67);
#ifndef _LIB_BUILD
asm("CCPR2H equ 0F67h");
#endif

// Register: CCP1CON
#define CCP1CON CCP1CON
extern volatile unsigned char           CCP1CON             __at(0xF68);
#ifndef _LIB_BUILD
asm("CCP1CON equ 0F68h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1M                  :4;
        unsigned DC1B                   :2;
    };
    struct {
        unsigned CCP1M0                 :1;
        unsigned CCP1M1                 :1;
        unsigned CCP1M2                 :1;
        unsigned CCP1M3                 :1;
        unsigned DC1B0                  :1;
        unsigned DC1B1                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned DCCP1Y                 :1;
        unsigned DCCP1X                 :1;
    };
} CCP1CONbits_t;
extern volatile CCP1CONbits_t CCP1CONbits __at(0xF68);
// bitfield macros
#define _CCP1CON_CCP1M_POSN                                 0x0
#define _CCP1CON_CCP1M_POSITION                             0x0
#define _CCP1CON_CCP1M_SIZE                                 0x4
#define _CCP1CON_CCP1M_LENGTH                               0x4
#define _CCP1CON_CCP1M_MASK                                 0xF
#define _CCP1CON_DC1B_POSN                                  0x4
#define _CCP1CON_DC1B_POSITION                              0x4
#define _CCP1CON_DC1B_SIZE                                  0x2
#define _CCP1CON_DC1B_LENGTH                                0x2
#define _CCP1CON_DC1B_MASK                                  0x30
#define _CCP1CON_CCP1M0_POSN                                0x0
#define _CCP1CON_CCP1M0_POSITION                            0x0
#define _CCP1CON_CCP1M0_SIZE                                0x1
#define _CCP1CON_CCP1M0_LENGTH                              0x1
#define _CCP1CON_CCP1M0_MASK                                0x1
#define _CCP1CON_CCP1M1_POSN                                0x1
#define _CCP1CON_CCP1M1_POSITION                            0x1
#define _CCP1CON_CCP1M1_SIZE                                0x1
#define _CCP1CON_CCP1M1_LENGTH                              0x1
#define _CCP1CON_CCP1M1_MASK                                0x2
#define _CCP1CON_CCP1M2_POSN                                0x2
#define _CCP1CON_CCP1M2_POSITION                            0x2
#define _CCP1CON_CCP1M2_SIZE                                0x1
#define _CCP1CON_CCP1M2_LENGTH                              0x1
#define _CCP1CON_CCP1M2_MASK                                0x4
#define _CCP1CON_CCP1M3_POSN                                0x3
#define _CCP1CON_CCP1M3_POSITION                            0x3
#define _CCP1CON_CCP1M3_SIZE                                0x1
#define _CCP1CON_CCP1M3_LENGTH                              0x1
#define _CCP1CON_CCP1M3_MASK                                0x8
#define _CCP1CON_DC1B0_POSN                                 0x4
#define _CCP1CON_DC1B0_POSITION                             0x4
#define _CCP1CON_DC1B0_SIZE                                 0x1
#define _CCP1CON_DC1B0_LENGTH                               0x1
#define _CCP1CON_DC1B0_MASK                                 0x10
#define _CCP1CON_DC1B1_POSN                                 0x5
#define _CCP1CON_DC1B1_POSITION                             0x5
#define _CCP1CON_DC1B1_SIZE                                 0x1
#define _CCP1CON_DC1B1_LENGTH                               0x1
#define _CCP1CON_DC1B1_MASK                                 0x20
#define _CCP1CON_DCCP1Y_POSN                                0x4
#define _CCP1CON_DCCP1Y_POSITION                            0x4
#define _CCP1CON_DCCP1Y_SIZE                                0x1
#define _CCP1CON_DCCP1Y_LENGTH                              0x1
#define _CCP1CON_DCCP1Y_MASK                                0x10
#define _CCP1CON_DCCP1X_POSN                                0x5
#define _CCP1CON_DCCP1X_POSITION                            0x5
#define _CCP1CON_DCCP1X_SIZE                                0x1
#define _CCP1CON_DCCP1X_LENGTH                              0x1
#define _CCP1CON_DCCP1X_MASK                                0x20

// Register: CCPR1
#define CCPR1 CCPR1
extern volatile unsigned short          CCPR1               __at(0xF69);
#ifndef _LIB_BUILD
asm("CCPR1 equ 0F69h");
#endif

// Register: CCPR1L
#define CCPR1L CCPR1L
extern volatile unsigned char           CCPR1L              __at(0xF69);
#ifndef _LIB_BUILD
asm("CCPR1L equ 0F69h");
#endif

// Register: CCPR1H
#define CCPR1H CCPR1H
extern volatile unsigned char           CCPR1H              __at(0xF6A);
#ifndef _LIB_BUILD
asm("CCPR1H equ 0F6Ah");
#endif

// Register: LCDDATA5
#define LCDDATA5 LCDDATA5
extern volatile unsigned char           LCDDATA5            __at(0xF6B);
#ifndef _LIB_BUILD
asm("LCDDATA5 equ 0F6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA5               :8;
    };
    struct {
        unsigned S40C0                  :1;
        unsigned S41C0                  :1;
        unsigned S42C0                  :1;
        unsigned S43C0                  :1;
        unsigned S44C0                  :1;
        unsigned S45C0                  :1;
        unsigned S46C0                  :1;
        unsigned S47C0                  :1;
    };
    struct {
        unsigned SEG40COM0              :1;
        unsigned SEG41COM0              :1;
        unsigned SEG42COM0              :1;
        unsigned SEG43COM0              :1;
        unsigned SEG44COM0              :1;
        unsigned SEG45COM0              :1;
        unsigned SEG46COM0              :1;
        unsigned SEG47COM0              :1;
    };
    struct {
        unsigned S40C15                 :1;
    };
} LCDDATA5bits_t;
extern volatile LCDDATA5bits_t LCDDATA5bits __at(0xF6B);
// bitfield macros
#define _LCDDATA5_LCDDATA5_POSN                             0x0
#define _LCDDATA5_LCDDATA5_POSITION                         0x0
#define _LCDDATA5_LCDDATA5_SIZE                             0x8
#define _LCDDATA5_LCDDATA5_LENGTH                           0x8
#define _LCDDATA5_LCDDATA5_MASK                             0xFF
#define _LCDDATA5_S40C0_POSN                                0x0
#define _LCDDATA5_S40C0_POSITION                            0x0
#define _LCDDATA5_S40C0_SIZE                                0x1
#define _LCDDATA5_S40C0_LENGTH                              0x1
#define _LCDDATA5_S40C0_MASK                                0x1
#define _LCDDATA5_S41C0_POSN                                0x1
#define _LCDDATA5_S41C0_POSITION                            0x1
#define _LCDDATA5_S41C0_SIZE                                0x1
#define _LCDDATA5_S41C0_LENGTH                              0x1
#define _LCDDATA5_S41C0_MASK                                0x2
#define _LCDDATA5_S42C0_POSN                                0x2
#define _LCDDATA5_S42C0_POSITION                            0x2
#define _LCDDATA5_S42C0_SIZE                                0x1
#define _LCDDATA5_S42C0_LENGTH                              0x1
#define _LCDDATA5_S42C0_MASK                                0x4
#define _LCDDATA5_S43C0_POSN                                0x3
#define _LCDDATA5_S43C0_POSITION                            0x3
#define _LCDDATA5_S43C0_SIZE                                0x1
#define _LCDDATA5_S43C0_LENGTH                              0x1
#define _LCDDATA5_S43C0_MASK                                0x8
#define _LCDDATA5_S44C0_POSN                                0x4
#define _LCDDATA5_S44C0_POSITION                            0x4
#define _LCDDATA5_S44C0_SIZE                                0x1
#define _LCDDATA5_S44C0_LENGTH                              0x1
#define _LCDDATA5_S44C0_MASK                                0x10
#define _LCDDATA5_S45C0_POSN                                0x5
#define _LCDDATA5_S45C0_POSITION                            0x5
#define _LCDDATA5_S45C0_SIZE                                0x1
#define _LCDDATA5_S45C0_LENGTH                              0x1
#define _LCDDATA5_S45C0_MASK                                0x20
#define _LCDDATA5_S46C0_POSN                                0x6
#define _LCDDATA5_S46C0_POSITION                            0x6
#define _LCDDATA5_S46C0_SIZE                                0x1
#define _LCDDATA5_S46C0_LENGTH                              0x1
#define _LCDDATA5_S46C0_MASK                                0x40
#define _LCDDATA5_S47C0_POSN                                0x7
#define _LCDDATA5_S47C0_POSITION                            0x7
#define _LCDDATA5_S47C0_SIZE                                0x1
#define _LCDDATA5_S47C0_LENGTH                              0x1
#define _LCDDATA5_S47C0_MASK                                0x80
#define _LCDDATA5_SEG40COM0_POSN                            0x0
#define _LCDDATA5_SEG40COM0_POSITION                        0x0
#define _LCDDATA5_SEG40COM0_SIZE                            0x1
#define _LCDDATA5_SEG40COM0_LENGTH                          0x1
#define _LCDDATA5_SEG40COM0_MASK                            0x1
#define _LCDDATA5_SEG41COM0_POSN                            0x1
#define _LCDDATA5_SEG41COM0_POSITION                        0x1
#define _LCDDATA5_SEG41COM0_SIZE                            0x1
#define _LCDDATA5_SEG41COM0_LENGTH                          0x1
#define _LCDDATA5_SEG41COM0_MASK                            0x2
#define _LCDDATA5_SEG42COM0_POSN                            0x2
#define _LCDDATA5_SEG42COM0_POSITION                        0x2
#define _LCDDATA5_SEG42COM0_SIZE                            0x1
#define _LCDDATA5_SEG42COM0_LENGTH                          0x1
#define _LCDDATA5_SEG42COM0_MASK                            0x4
#define _LCDDATA5_SEG43COM0_POSN                            0x3
#define _LCDDATA5_SEG43COM0_POSITION                        0x3
#define _LCDDATA5_SEG43COM0_SIZE                            0x1
#define _LCDDATA5_SEG43COM0_LENGTH                          0x1
#define _LCDDATA5_SEG43COM0_MASK                            0x8
#define _LCDDATA5_SEG44COM0_POSN                            0x4
#define _LCDDATA5_SEG44COM0_POSITION                        0x4
#define _LCDDATA5_SEG44COM0_SIZE                            0x1
#define _LCDDATA5_SEG44COM0_LENGTH                          0x1
#define _LCDDATA5_SEG44COM0_MASK                            0x10
#define _LCDDATA5_SEG45COM0_POSN                            0x5
#define _LCDDATA5_SEG45COM0_POSITION                        0x5
#define _LCDDATA5_SEG45COM0_SIZE                            0x1
#define _LCDDATA5_SEG45COM0_LENGTH                          0x1
#define _LCDDATA5_SEG45COM0_MASK                            0x20
#define _LCDDATA5_SEG46COM0_POSN                            0x6
#define _LCDDATA5_SEG46COM0_POSITION                        0x6
#define _LCDDATA5_SEG46COM0_SIZE                            0x1
#define _LCDDATA5_SEG46COM0_LENGTH                          0x1
#define _LCDDATA5_SEG46COM0_MASK                            0x40
#define _LCDDATA5_SEG47COM0_POSN                            0x7
#define _LCDDATA5_SEG47COM0_POSITION                        0x7
#define _LCDDATA5_SEG47COM0_SIZE                            0x1
#define _LCDDATA5_SEG47COM0_LENGTH                          0x1
#define _LCDDATA5_SEG47COM0_MASK                            0x80
#define _LCDDATA5_S40C15_POSN                               0x0
#define _LCDDATA5_S40C15_POSITION                           0x0
#define _LCDDATA5_S40C15_SIZE                               0x1
#define _LCDDATA5_S40C15_LENGTH                             0x1
#define _LCDDATA5_S40C15_MASK                               0x1

