MikroElektronika/core_packages/PIC/XC8/def/PIC18F83J90/mcu.h
extern volatile LCDDATA10bits_t LCDDATA10bits __at(0xF70);
// bitfield macros
#define _LCDDATA10_LCDDATA10_POSN                           0x0
#define _LCDDATA10_LCDDATA10_POSITION                       0x0
#define _LCDDATA10_LCDDATA10_SIZE                           0x8
#define _LCDDATA10_LCDDATA10_LENGTH                         0x8
#define _LCDDATA10_LCDDATA10_MASK                           0xFF
#define _LCDDATA10_S32C1_POSN                               0x0
#define _LCDDATA10_S32C1_POSITION                           0x0
#define _LCDDATA10_S32C1_SIZE                               0x1
#define _LCDDATA10_S32C1_LENGTH                             0x1
#define _LCDDATA10_S32C1_MASK                               0x1
#define _LCDDATA10_S33C1_POSN                               0x1
#define _LCDDATA10_S33C1_POSITION                           0x1
#define _LCDDATA10_S33C1_SIZE                               0x1
#define _LCDDATA10_S33C1_LENGTH                             0x1
#define _LCDDATA10_S33C1_MASK                               0x2
#define _LCDDATA10_S34C1_POSN                               0x2
#define _LCDDATA10_S34C1_POSITION                           0x2
#define _LCDDATA10_S34C1_SIZE                               0x1
#define _LCDDATA10_S34C1_LENGTH                             0x1
#define _LCDDATA10_S34C1_MASK                               0x4
#define _LCDDATA10_S35C1_POSN                               0x3
#define _LCDDATA10_S35C1_POSITION                           0x3
#define _LCDDATA10_S35C1_SIZE                               0x1
#define _LCDDATA10_S35C1_LENGTH                             0x1
#define _LCDDATA10_S35C1_MASK                               0x8
#define _LCDDATA10_S36C1_POSN                               0x4
#define _LCDDATA10_S36C1_POSITION                           0x4
#define _LCDDATA10_S36C1_SIZE                               0x1
#define _LCDDATA10_S36C1_LENGTH                             0x1
#define _LCDDATA10_S36C1_MASK                               0x10
#define _LCDDATA10_S37C1_POSN                               0x5
#define _LCDDATA10_S37C1_POSITION                           0x5
#define _LCDDATA10_S37C1_SIZE                               0x1
#define _LCDDATA10_S37C1_LENGTH                             0x1
#define _LCDDATA10_S37C1_MASK                               0x20
#define _LCDDATA10_S38C1_POSN                               0x6
#define _LCDDATA10_S38C1_POSITION                           0x6
#define _LCDDATA10_S38C1_SIZE                               0x1
#define _LCDDATA10_S38C1_LENGTH                             0x1
#define _LCDDATA10_S38C1_MASK                               0x40
#define _LCDDATA10_S39C1_POSN                               0x7
#define _LCDDATA10_S39C1_POSITION                           0x7
#define _LCDDATA10_S39C1_SIZE                               0x1
#define _LCDDATA10_S39C1_LENGTH                             0x1
#define _LCDDATA10_S39C1_MASK                               0x80
#define _LCDDATA10_SEG32COM1_POSN                           0x0
#define _LCDDATA10_SEG32COM1_POSITION                       0x0
#define _LCDDATA10_SEG32COM1_SIZE                           0x1
#define _LCDDATA10_SEG32COM1_LENGTH                         0x1
#define _LCDDATA10_SEG32COM1_MASK                           0x1
#define _LCDDATA10_SEG33COM1_POSN                           0x1
#define _LCDDATA10_SEG33COM1_POSITION                       0x1
#define _LCDDATA10_SEG33COM1_SIZE                           0x1
#define _LCDDATA10_SEG33COM1_LENGTH                         0x1
#define _LCDDATA10_SEG33COM1_MASK                           0x2
#define _LCDDATA10_SEG34COM1_POSN                           0x2
#define _LCDDATA10_SEG34COM1_POSITION                       0x2
#define _LCDDATA10_SEG34COM1_SIZE                           0x1
#define _LCDDATA10_SEG34COM1_LENGTH                         0x1
#define _LCDDATA10_SEG34COM1_MASK                           0x4
#define _LCDDATA10_SEG35COM1_POSN                           0x3
#define _LCDDATA10_SEG35COM1_POSITION                       0x3
#define _LCDDATA10_SEG35COM1_SIZE                           0x1
#define _LCDDATA10_SEG35COM1_LENGTH                         0x1
#define _LCDDATA10_SEG35COM1_MASK                           0x8
#define _LCDDATA10_SEG36COM1_POSN                           0x4
#define _LCDDATA10_SEG36COM1_POSITION                       0x4
#define _LCDDATA10_SEG36COM1_SIZE                           0x1
#define _LCDDATA10_SEG36COM1_LENGTH                         0x1
#define _LCDDATA10_SEG36COM1_MASK                           0x10
#define _LCDDATA10_SEG37COM1_POSN                           0x5
#define _LCDDATA10_SEG37COM1_POSITION                       0x5
#define _LCDDATA10_SEG37COM1_SIZE                           0x1
#define _LCDDATA10_SEG37COM1_LENGTH                         0x1
#define _LCDDATA10_SEG37COM1_MASK                           0x20
#define _LCDDATA10_SEG38COM1_POSN                           0x6
#define _LCDDATA10_SEG38COM1_POSITION                       0x6
#define _LCDDATA10_SEG38COM1_SIZE                           0x1
#define _LCDDATA10_SEG38COM1_LENGTH                         0x1
#define _LCDDATA10_SEG38COM1_MASK                           0x40
#define _LCDDATA10_SEG39COM1_POSN                           0x7
#define _LCDDATA10_SEG39COM1_POSITION                       0x7
#define _LCDDATA10_SEG39COM1_SIZE                           0x1
#define _LCDDATA10_SEG39COM1_LENGTH                         0x1
#define _LCDDATA10_SEG39COM1_MASK                           0x80

// Register: LCDDATA11
#define LCDDATA11 LCDDATA11
extern volatile unsigned char           LCDDATA11           __at(0xF71);
#ifndef _LIB_BUILD
asm("LCDDATA11 equ 0F71h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA11              :8;
    };
    struct {
        unsigned S40C1                  :1;
        unsigned S41C1                  :1;
        unsigned S42C1                  :1;
        unsigned S43C1                  :1;
        unsigned S44C1                  :1;
        unsigned S45C1                  :1;
        unsigned S46C1                  :1;
        unsigned S47C1                  :1;
    };
    struct {
        unsigned SEG40COM1              :1;
        unsigned SEG41COM1              :1;
        unsigned SEG42COM1              :1;
        unsigned SEG43COM1              :1;
        unsigned SEG44COM1              :1;
        unsigned SEG45COM1              :1;
        unsigned SEG46COM1              :1;
        unsigned SEG47COM1              :1;
    };
    struct {
        unsigned                        :1;
        unsigned ADMSK1                 :1;
        unsigned ADMSK2                 :1;
        unsigned ADMSK3                 :1;
        unsigned ADMSK4                 :1;
        unsigned ADMSK5                 :1;
    };
} LCDDATA11bits_t;
