MikroElektronika/core_packages/PIC/XC8/def/PIC18F83J90/mcu.h
// Register: LCDDATA22
#define LCDDATA22 LCDDATA22
extern volatile unsigned char           LCDDATA22           __at(0xF7C);
#ifndef _LIB_BUILD
asm("LCDDATA22 equ 0F7Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA22              :8;
    };
    struct {
        unsigned S32C3                  :1;
        unsigned S33C3                  :1;
        unsigned S34C3                  :1;
        unsigned S35C3                  :1;
        unsigned S36C3                  :1;
        unsigned S37C3                  :1;
        unsigned S38C3                  :1;
        unsigned S39C3                  :1;
    };
    struct {
        unsigned SEG32COM3              :1;
        unsigned SEG33COM3              :1;
        unsigned SEG34COM3              :1;
        unsigned SEG35COM3              :1;
        unsigned SEG36COM3              :1;
        unsigned SEG37COM3              :1;
        unsigned SEG38COM3              :1;
        unsigned SEG39COM3              :1;
    };
} LCDDATA22bits_t;
extern volatile LCDDATA22bits_t LCDDATA22bits __at(0xF7C);
// bitfield macros
#define _LCDDATA22_LCDDATA22_POSN                           0x0
#define _LCDDATA22_LCDDATA22_POSITION                       0x0
#define _LCDDATA22_LCDDATA22_SIZE                           0x8
#define _LCDDATA22_LCDDATA22_LENGTH                         0x8
#define _LCDDATA22_LCDDATA22_MASK                           0xFF
#define _LCDDATA22_S32C3_POSN                               0x0
#define _LCDDATA22_S32C3_POSITION                           0x0
#define _LCDDATA22_S32C3_SIZE                               0x1
#define _LCDDATA22_S32C3_LENGTH                             0x1
#define _LCDDATA22_S32C3_MASK                               0x1
#define _LCDDATA22_S33C3_POSN                               0x1
#define _LCDDATA22_S33C3_POSITION                           0x1
#define _LCDDATA22_S33C3_SIZE                               0x1
#define _LCDDATA22_S33C3_LENGTH                             0x1
#define _LCDDATA22_S33C3_MASK                               0x2
#define _LCDDATA22_S34C3_POSN                               0x2
#define _LCDDATA22_S34C3_POSITION                           0x2
#define _LCDDATA22_S34C3_SIZE                               0x1
#define _LCDDATA22_S34C3_LENGTH                             0x1
#define _LCDDATA22_S34C3_MASK                               0x4
#define _LCDDATA22_S35C3_POSN                               0x3
#define _LCDDATA22_S35C3_POSITION                           0x3
#define _LCDDATA22_S35C3_SIZE                               0x1
#define _LCDDATA22_S35C3_LENGTH                             0x1
#define _LCDDATA22_S35C3_MASK                               0x8
#define _LCDDATA22_S36C3_POSN                               0x4
#define _LCDDATA22_S36C3_POSITION                           0x4
#define _LCDDATA22_S36C3_SIZE                               0x1
#define _LCDDATA22_S36C3_LENGTH                             0x1
#define _LCDDATA22_S36C3_MASK                               0x10
#define _LCDDATA22_S37C3_POSN                               0x5
#define _LCDDATA22_S37C3_POSITION                           0x5
#define _LCDDATA22_S37C3_SIZE                               0x1
#define _LCDDATA22_S37C3_LENGTH                             0x1
#define _LCDDATA22_S37C3_MASK                               0x20
#define _LCDDATA22_S38C3_POSN                               0x6
#define _LCDDATA22_S38C3_POSITION                           0x6
#define _LCDDATA22_S38C3_SIZE                               0x1
#define _LCDDATA22_S38C3_LENGTH                             0x1
#define _LCDDATA22_S38C3_MASK                               0x40
#define _LCDDATA22_S39C3_POSN                               0x7
#define _LCDDATA22_S39C3_POSITION                           0x7
#define _LCDDATA22_S39C3_SIZE                               0x1
#define _LCDDATA22_S39C3_LENGTH                             0x1
#define _LCDDATA22_S39C3_MASK                               0x80
#define _LCDDATA22_SEG32COM3_POSN                           0x0
#define _LCDDATA22_SEG32COM3_POSITION                       0x0
#define _LCDDATA22_SEG32COM3_SIZE                           0x1
#define _LCDDATA22_SEG32COM3_LENGTH                         0x1
#define _LCDDATA22_SEG32COM3_MASK                           0x1
#define _LCDDATA22_SEG33COM3_POSN                           0x1
#define _LCDDATA22_SEG33COM3_POSITION                       0x1
#define _LCDDATA22_SEG33COM3_SIZE                           0x1
#define _LCDDATA22_SEG33COM3_LENGTH                         0x1
#define _LCDDATA22_SEG33COM3_MASK                           0x2
#define _LCDDATA22_SEG34COM3_POSN                           0x2
#define _LCDDATA22_SEG34COM3_POSITION                       0x2
#define _LCDDATA22_SEG34COM3_SIZE                           0x1
#define _LCDDATA22_SEG34COM3_LENGTH                         0x1
#define _LCDDATA22_SEG34COM3_MASK                           0x4
#define _LCDDATA22_SEG35COM3_POSN                           0x3
#define _LCDDATA22_SEG35COM3_POSITION                       0x3
#define _LCDDATA22_SEG35COM3_SIZE                           0x1
#define _LCDDATA22_SEG35COM3_LENGTH                         0x1
#define _LCDDATA22_SEG35COM3_MASK                           0x8
#define _LCDDATA22_SEG36COM3_POSN                           0x4
#define _LCDDATA22_SEG36COM3_POSITION                       0x4
#define _LCDDATA22_SEG36COM3_SIZE                           0x1
#define _LCDDATA22_SEG36COM3_LENGTH                         0x1
#define _LCDDATA22_SEG36COM3_MASK                           0x10
#define _LCDDATA22_SEG37COM3_POSN                           0x5
#define _LCDDATA22_SEG37COM3_POSITION                       0x5
#define _LCDDATA22_SEG37COM3_SIZE                           0x1
#define _LCDDATA22_SEG37COM3_LENGTH                         0x1
#define _LCDDATA22_SEG37COM3_MASK                           0x20
#define _LCDDATA22_SEG38COM3_POSN                           0x6
#define _LCDDATA22_SEG38COM3_POSITION                       0x6
#define _LCDDATA22_SEG38COM3_SIZE                           0x1
#define _LCDDATA22_SEG38COM3_LENGTH                         0x1
#define _LCDDATA22_SEG38COM3_MASK                           0x40
#define _LCDDATA22_SEG39COM3_POSN                           0x7
#define _LCDDATA22_SEG39COM3_POSITION                       0x7
#define _LCDDATA22_SEG39COM3_SIZE                           0x1
#define _LCDDATA22_SEG39COM3_LENGTH                         0x1
#define _LCDDATA22_SEG39COM3_MASK                           0x80

// Register: LCDDATA23
#define LCDDATA23 LCDDATA23
extern volatile unsigned char           LCDDATA23           __at(0xF7D);
#ifndef _LIB_BUILD
asm("LCDDATA23 equ 0F7Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA23              :8;
    };
    struct {
        unsigned S40C3                  :1;
        unsigned S41C3                  :1;
        unsigned S42C3                  :1;
        unsigned S43C3                  :1;
        unsigned S44C3                  :1;
        unsigned S45C3                  :1;
        unsigned S46C3                  :1;
        unsigned S47C3                  :1;
    };
    struct {
        unsigned SEG40COM3              :1;
        unsigned SEG41COM3              :1;
        unsigned SEG42COM3              :1;
        unsigned SEG43COM3              :1;
        unsigned SEG44COM3              :1;
        unsigned SEG45COM3              :1;
        unsigned SEG46COM3              :1;
        unsigned SEG47COM3              :1;
    };
} LCDDATA23bits_t;
