MikroElektronika/core_packages/PIC/XC8/def/PIC18F83J90/mcu.h
// Register: LCDSE4
#define LCDSE4 LCDSE4
extern volatile unsigned char           LCDSE4              __at(0xFB9);
#ifndef _LIB_BUILD
asm("LCDSE4 equ 0FB9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDSE4                 :8;
    };
    struct {
        unsigned SE32                   :1;
        unsigned SE33                   :1;
        unsigned SE34                   :1;
        unsigned SE35                   :1;
        unsigned SE36                   :1;
        unsigned SE37                   :1;
        unsigned SE38                   :1;
        unsigned SE39                   :1;
    };
    struct {
        unsigned SEGEN32                :1;
        unsigned SEGEN33                :1;
        unsigned SEGEN34                :1;
        unsigned SEGEN35                :1;
        unsigned SEGEN36                :1;
        unsigned SEGEN37                :1;
        unsigned SEGEN38                :1;
        unsigned SEGEN39                :1;
    };
} LCDSE4bits_t;
extern volatile LCDSE4bits_t LCDSE4bits __at(0xFB9);
// bitfield macros
#define _LCDSE4_LCDSE4_POSN                                 0x0
#define _LCDSE4_LCDSE4_POSITION                             0x0
#define _LCDSE4_LCDSE4_SIZE                                 0x8
#define _LCDSE4_LCDSE4_LENGTH                               0x8
#define _LCDSE4_LCDSE4_MASK                                 0xFF
#define _LCDSE4_SE32_POSN                                   0x0
#define _LCDSE4_SE32_POSITION                               0x0
#define _LCDSE4_SE32_SIZE                                   0x1
#define _LCDSE4_SE32_LENGTH                                 0x1
#define _LCDSE4_SE32_MASK                                   0x1
#define _LCDSE4_SE33_POSN                                   0x1
#define _LCDSE4_SE33_POSITION                               0x1
#define _LCDSE4_SE33_SIZE                                   0x1
#define _LCDSE4_SE33_LENGTH                                 0x1
#define _LCDSE4_SE33_MASK                                   0x2
#define _LCDSE4_SE34_POSN                                   0x2
#define _LCDSE4_SE34_POSITION                               0x2
#define _LCDSE4_SE34_SIZE                                   0x1
#define _LCDSE4_SE34_LENGTH                                 0x1
#define _LCDSE4_SE34_MASK                                   0x4
#define _LCDSE4_SE35_POSN                                   0x3
#define _LCDSE4_SE35_POSITION                               0x3
#define _LCDSE4_SE35_SIZE                                   0x1
#define _LCDSE4_SE35_LENGTH                                 0x1
#define _LCDSE4_SE35_MASK                                   0x8
#define _LCDSE4_SE36_POSN                                   0x4
#define _LCDSE4_SE36_POSITION                               0x4
#define _LCDSE4_SE36_SIZE                                   0x1
#define _LCDSE4_SE36_LENGTH                                 0x1
#define _LCDSE4_SE36_MASK                                   0x10
#define _LCDSE4_SE37_POSN                                   0x5
#define _LCDSE4_SE37_POSITION                               0x5
#define _LCDSE4_SE37_SIZE                                   0x1
#define _LCDSE4_SE37_LENGTH                                 0x1
#define _LCDSE4_SE37_MASK                                   0x20
#define _LCDSE4_SE38_POSN                                   0x6
#define _LCDSE4_SE38_POSITION                               0x6
#define _LCDSE4_SE38_SIZE                                   0x1
#define _LCDSE4_SE38_LENGTH                                 0x1
#define _LCDSE4_SE38_MASK                                   0x40
#define _LCDSE4_SE39_POSN                                   0x7
#define _LCDSE4_SE39_POSITION                               0x7
#define _LCDSE4_SE39_SIZE                                   0x1
#define _LCDSE4_SE39_LENGTH                                 0x1
#define _LCDSE4_SE39_MASK                                   0x80
#define _LCDSE4_SEGEN32_POSN                                0x0
#define _LCDSE4_SEGEN32_POSITION                            0x0
#define _LCDSE4_SEGEN32_SIZE                                0x1
#define _LCDSE4_SEGEN32_LENGTH                              0x1
#define _LCDSE4_SEGEN32_MASK                                0x1
#define _LCDSE4_SEGEN33_POSN                                0x1
#define _LCDSE4_SEGEN33_POSITION                            0x1
#define _LCDSE4_SEGEN33_SIZE                                0x1
#define _LCDSE4_SEGEN33_LENGTH                              0x1
#define _LCDSE4_SEGEN33_MASK                                0x2
#define _LCDSE4_SEGEN34_POSN                                0x2
#define _LCDSE4_SEGEN34_POSITION                            0x2
#define _LCDSE4_SEGEN34_SIZE                                0x1
#define _LCDSE4_SEGEN34_LENGTH                              0x1
#define _LCDSE4_SEGEN34_MASK                                0x4
#define _LCDSE4_SEGEN35_POSN                                0x3
#define _LCDSE4_SEGEN35_POSITION                            0x3
#define _LCDSE4_SEGEN35_SIZE                                0x1
#define _LCDSE4_SEGEN35_LENGTH                              0x1
#define _LCDSE4_SEGEN35_MASK                                0x8
#define _LCDSE4_SEGEN36_POSN                                0x4
#define _LCDSE4_SEGEN36_POSITION                            0x4
#define _LCDSE4_SEGEN36_SIZE                                0x1
#define _LCDSE4_SEGEN36_LENGTH                              0x1
#define _LCDSE4_SEGEN36_MASK                                0x10
#define _LCDSE4_SEGEN37_POSN                                0x5
#define _LCDSE4_SEGEN37_POSITION                            0x5
#define _LCDSE4_SEGEN37_SIZE                                0x1
#define _LCDSE4_SEGEN37_LENGTH                              0x1
#define _LCDSE4_SEGEN37_MASK                                0x20
#define _LCDSE4_SEGEN38_POSN                                0x6
#define _LCDSE4_SEGEN38_POSITION                            0x6
#define _LCDSE4_SEGEN38_SIZE                                0x1
#define _LCDSE4_SEGEN38_LENGTH                              0x1
#define _LCDSE4_SEGEN38_MASK                                0x40
#define _LCDSE4_SEGEN39_POSN                                0x7
#define _LCDSE4_SEGEN39_POSITION                            0x7
#define _LCDSE4_SEGEN39_SIZE                                0x1
#define _LCDSE4_SEGEN39_LENGTH                              0x1
#define _LCDSE4_SEGEN39_MASK                                0x80

// Register: LCDSE5
#define LCDSE5 LCDSE5
extern volatile unsigned char           LCDSE5              __at(0xFBA);
#ifndef _LIB_BUILD
asm("LCDSE5 equ 0FBAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDSE5                 :8;
    };
    struct {
        unsigned SE40                   :1;
        unsigned SE41                   :1;
        unsigned SE42                   :1;
        unsigned SE43                   :1;
        unsigned SE44                   :1;
        unsigned SE45                   :1;
        unsigned SE46                   :1;
        unsigned SE47                   :1;
    };
    struct {
        unsigned SEGEN40                :1;
        unsigned SEGEN41                :1;
        unsigned SEGEN42                :1;
        unsigned SEGEN43                :1;
        unsigned SEGEN44                :1;
        unsigned SEGEN45                :1;
        unsigned SEGEN46                :1;
        unsigned SEGEN47                :1;
    };
} LCDSE5bits_t;
extern volatile LCDSE5bits_t LCDSE5bits __at(0xFBA);
// bitfield macros
#define _LCDSE5_LCDSE5_POSN                                 0x0
#define _LCDSE5_LCDSE5_POSITION                             0x0
#define _LCDSE5_LCDSE5_SIZE                                 0x8
#define _LCDSE5_LCDSE5_LENGTH                               0x8
#define _LCDSE5_LCDSE5_MASK                                 0xFF
#define _LCDSE5_SE40_POSN                                   0x0
#define _LCDSE5_SE40_POSITION                               0x0
#define _LCDSE5_SE40_SIZE                                   0x1
#define _LCDSE5_SE40_LENGTH                                 0x1
#define _LCDSE5_SE40_MASK                                   0x1
#define _LCDSE5_SE41_POSN                                   0x1
#define _LCDSE5_SE41_POSITION                               0x1
#define _LCDSE5_SE41_SIZE                                   0x1
#define _LCDSE5_SE41_LENGTH                                 0x1
#define _LCDSE5_SE41_MASK                                   0x2
#define _LCDSE5_SE42_POSN                                   0x2
#define _LCDSE5_SE42_POSITION                               0x2
#define _LCDSE5_SE42_SIZE                                   0x1
#define _LCDSE5_SE42_LENGTH                                 0x1
#define _LCDSE5_SE42_MASK                                   0x4
#define _LCDSE5_SE43_POSN                                   0x3
#define _LCDSE5_SE43_POSITION                               0x3
#define _LCDSE5_SE43_SIZE                                   0x1
#define _LCDSE5_SE43_LENGTH                                 0x1
#define _LCDSE5_SE43_MASK                                   0x8
#define _LCDSE5_SE44_POSN                                   0x4
#define _LCDSE5_SE44_POSITION                               0x4
#define _LCDSE5_SE44_SIZE                                   0x1
#define _LCDSE5_SE44_LENGTH                                 0x1
#define _LCDSE5_SE44_MASK                                   0x10
#define _LCDSE5_SE45_POSN                                   0x5
#define _LCDSE5_SE45_POSITION                               0x5
#define _LCDSE5_SE45_SIZE                                   0x1
#define _LCDSE5_SE45_LENGTH                                 0x1
#define _LCDSE5_SE45_MASK                                   0x20
#define _LCDSE5_SE46_POSN                                   0x6
#define _LCDSE5_SE46_POSITION                               0x6
#define _LCDSE5_SE46_SIZE                                   0x1
#define _LCDSE5_SE46_LENGTH                                 0x1
#define _LCDSE5_SE46_MASK                                   0x40
#define _LCDSE5_SE47_POSN                                   0x7
#define _LCDSE5_SE47_POSITION                               0x7
#define _LCDSE5_SE47_SIZE                                   0x1
#define _LCDSE5_SE47_LENGTH                                 0x1
#define _LCDSE5_SE47_MASK                                   0x80
#define _LCDSE5_SEGEN40_POSN                                0x0
#define _LCDSE5_SEGEN40_POSITION                            0x0
#define _LCDSE5_SEGEN40_SIZE                                0x1
#define _LCDSE5_SEGEN40_LENGTH                              0x1
#define _LCDSE5_SEGEN40_MASK                                0x1
#define _LCDSE5_SEGEN41_POSN                                0x1
#define _LCDSE5_SEGEN41_POSITION                            0x1
#define _LCDSE5_SEGEN41_SIZE                                0x1
#define _LCDSE5_SEGEN41_LENGTH                              0x1
#define _LCDSE5_SEGEN41_MASK                                0x2
#define _LCDSE5_SEGEN42_POSN                                0x2
#define _LCDSE5_SEGEN42_POSITION                            0x2
#define _LCDSE5_SEGEN42_SIZE                                0x1
#define _LCDSE5_SEGEN42_LENGTH                              0x1
#define _LCDSE5_SEGEN42_MASK                                0x4
#define _LCDSE5_SEGEN43_POSN                                0x3
#define _LCDSE5_SEGEN43_POSITION                            0x3
#define _LCDSE5_SEGEN43_SIZE                                0x1
#define _LCDSE5_SEGEN43_LENGTH                              0x1
#define _LCDSE5_SEGEN43_MASK                                0x8
#define _LCDSE5_SEGEN44_POSN                                0x4
#define _LCDSE5_SEGEN44_POSITION                            0x4
#define _LCDSE5_SEGEN44_SIZE                                0x1
#define _LCDSE5_SEGEN44_LENGTH                              0x1
#define _LCDSE5_SEGEN44_MASK                                0x10
#define _LCDSE5_SEGEN45_POSN                                0x5
#define _LCDSE5_SEGEN45_POSITION                            0x5
#define _LCDSE5_SEGEN45_SIZE                                0x1
#define _LCDSE5_SEGEN45_LENGTH                              0x1
#define _LCDSE5_SEGEN45_MASK                                0x20
#define _LCDSE5_SEGEN46_POSN                                0x6
#define _LCDSE5_SEGEN46_POSITION                            0x6
#define _LCDSE5_SEGEN46_SIZE                                0x1
#define _LCDSE5_SEGEN46_LENGTH                              0x1
#define _LCDSE5_SEGEN46_MASK                                0x40
#define _LCDSE5_SEGEN47_POSN                                0x7
#define _LCDSE5_SEGEN47_POSITION                            0x7
#define _LCDSE5_SEGEN47_SIZE                                0x1
#define _LCDSE5_SEGEN47_LENGTH                              0x1
#define _LCDSE5_SEGEN47_MASK                                0x80

// Register: LCDDATA0
#define LCDDATA0 LCDDATA0
extern volatile unsigned char           LCDDATA0            __at(0xFBB);
#ifndef _LIB_BUILD
asm("LCDDATA0 equ 0FBBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA0               :8;
    };
    struct {
        unsigned S0C0                   :1;
        unsigned S1C0                   :1;
        unsigned S2C0                   :1;
        unsigned S3C0                   :1;
        unsigned S4C0                   :1;
        unsigned S5C0                   :1;
        unsigned S6C0                   :1;
        unsigned S7C0                   :1;
    };
    struct {
        unsigned SEG0COM0               :1;
        unsigned SEG1COM0               :1;
        unsigned SEG2COM0               :1;
        unsigned SEG3COM0               :1;
        unsigned SEG4COM0               :1;
        unsigned SEG5COM0               :1;
        unsigned SEG6COM0               :1;
        unsigned SEG7COM0               :1;
    };
    struct {
        unsigned S00C0                  :1;
        unsigned S01C0                  :1;
        unsigned S02C0                  :1;
        unsigned S03C0                  :1;
        unsigned S04C0                  :1;
        unsigned S05C0                  :1;
        unsigned S06C0                  :1;
        unsigned S07C0                  :1;
    };
} LCDDATA0bits_t;
