MikroElektronika/core_packages/PIC/XC8/def/PIC18F83J90/mcu.h
extern volatile __bit                   RCEN1               __at(0x7E2B);	// @ (0xFC5 * 8 + 3)
#define                                 RCEN1_bit           _BIT_ACCESS(SSPCON2,3)
// BAUDCON1<RCIDL>
extern volatile __bit                   RCIDL               __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCIDL_bit           _BIT_ACCESS(BAUDCON1,6)
// BAUDCON1<RCIDL1>
extern volatile __bit                   RCIDL1              __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCIDL1_bit          _BIT_ACCESS(BAUDCON1,6)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x7CED);	// @ (0xF9D * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x7CF5);	// @ (0xF9E * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR1,5)
// IPR1<RCIP>
extern volatile __bit                   RCIP                __at(0x7CFD);	// @ (0xF9F * 8 + 5)
#define                                 RCIP_bit            _BIT_ACCESS(IPR1,5)
// BAUDCON1<RCMT>
extern volatile __bit                   RCMT                __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCMT_bit            _BIT_ACCESS(BAUDCON1,6)
// BAUDCON1<RCMT1>
extern volatile __bit                   RCMT1               __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCMT1_bit           _BIT_ACCESS(BAUDCON1,6)
// PORTD<RD0>
extern volatile __bit _DEPRECATED       RD0                 __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 RD0_bit             _BIT_ACCESS(PORTD,0)
// PORTD<RD1>
extern volatile __bit _DEPRECATED       RD1                 __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 RD1_bit             _BIT_ACCESS(PORTD,1)
// T3CON<RD163>
extern volatile __bit                   RD163               __at(0x7D8F);	// @ (0xFB1 * 8 + 7)
#define                                 RD163_bit           _BIT_ACCESS(T3CON,7)
// PORTD<RD2>
extern volatile __bit _DEPRECATED       RD2                 __at(0x7C1A);	// @ (0xF83 * 8 + 2)
#define                                 RD2_bit             _BIT_ACCESS(PORTD,2)
// PORTD<RD3>
extern volatile __bit _DEPRECATED       RD3                 __at(0x7C1B);	// @ (0xF83 * 8 + 3)
#define                                 RD3_bit             _BIT_ACCESS(PORTD,3)
// PORTD<RD4>
extern volatile __bit _DEPRECATED       RD4                 __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 RD4_bit             _BIT_ACCESS(PORTD,4)
// PORTD<RD5>
extern volatile __bit _DEPRECATED       RD5                 __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 RD5_bit             _BIT_ACCESS(PORTD,5)
// PORTD<RD6>
extern volatile __bit _DEPRECATED       RD6                 __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 RD6_bit             _BIT_ACCESS(PORTD,6)
// PORTD<RD7>
extern volatile __bit _DEPRECATED       RD7                 __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 RD7_bit             _BIT_ACCESS(PORTD,7)
// PORTE<RDE>
extern volatile __bit                   RDE                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 RDE_bit             _BIT_ACCESS(PORTE,0)
// PORTG<RDPU>
extern volatile __bit                   RDPU                __at(0x7C37);	// @ (0xF86 * 8 + 7)
#define                                 RDPU_bit            _BIT_ACCESS(PORTG,7)
// PORTE<RE0>
extern volatile __bit _DEPRECATED       RE0                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 RE0_bit             _BIT_ACCESS(PORTE,0)
// PORTE<RE1>
extern volatile __bit _DEPRECATED       RE1                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 RE1_bit             _BIT_ACCESS(PORTE,1)
// PORTE<RE3>
extern volatile __bit _DEPRECATED       RE3                 __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// PORTE<RE4>
extern volatile __bit _DEPRECATED       RE4                 __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 RE4_bit             _BIT_ACCESS(PORTE,4)
// PORTE<RE5>
extern volatile __bit _DEPRECATED       RE5                 __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 RE5_bit             _BIT_ACCESS(PORTE,5)
// PORTE<RE6>
extern volatile __bit _DEPRECATED       RE6                 __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 RE6_bit             _BIT_ACCESS(PORTE,6)
// PORTE<RE7>
extern volatile __bit _DEPRECATED       RE7                 __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 RE7_bit             _BIT_ACCESS(PORTE,7)
// SSPSTAT<READ_WRITE>
extern volatile __bit                   READ_WRITE          __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 READ_WRITE_bit      _BIT_ACCESS(SSPSTAT,2)
// WDTCON<REGSLP>
extern volatile __bit                   REGSLP              __at(0x7E8F);	// @ (0xFD1 * 8 + 7)
#define                                 REGSLP_bit          _BIT_ACCESS(WDTCON,7)
// PORTG<REPU>
extern volatile __bit                   REPU                __at(0x7C36);	// @ (0xF86 * 8 + 6)
#define                                 REPU_bit            _BIT_ACCESS(PORTG,6)
// PORTF<RF1>
extern volatile __bit _DEPRECATED       RF1                 __at(0x7C29);	// @ (0xF85 * 8 + 1)
#define                                 RF1_bit             _BIT_ACCESS(PORTF,1)
// PORTF<RF2>
extern volatile __bit _DEPRECATED       RF2                 __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 RF2_bit             _BIT_ACCESS(PORTF,2)
// PORTF<RF3>
extern volatile __bit _DEPRECATED       RF3                 __at(0x7C2B);	// @ (0xF85 * 8 + 3)
#define                                 RF3_bit             _BIT_ACCESS(PORTF,3)
// PORTF<RF4>
extern volatile __bit _DEPRECATED       RF4                 __at(0x7C2C);	// @ (0xF85 * 8 + 4)
#define                                 RF4_bit             _BIT_ACCESS(PORTF,4)
// PORTF<RF5>
extern volatile __bit _DEPRECATED       RF5                 __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 RF5_bit             _BIT_ACCESS(PORTF,5)
// PORTF<RF6>
extern volatile __bit _DEPRECATED       RF6                 __at(0x7C2E);	// @ (0xF85 * 8 + 6)
#define                                 RF6_bit             _BIT_ACCESS(PORTF,6)
// PORTF<RF7>
extern volatile __bit _DEPRECATED       RF7                 __at(0x7C2F);	// @ (0xF85 * 8 + 7)
#define                                 RF7_bit             _BIT_ACCESS(PORTF,7)
// PORTG<RG0>
extern volatile __bit _DEPRECATED       RG0                 __at(0x7C30);	// @ (0xF86 * 8 + 0)
#define                                 RG0_bit             _BIT_ACCESS(PORTG,0)
// PORTG<RG1>
extern volatile __bit _DEPRECATED       RG1                 __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 RG1_bit             _BIT_ACCESS(PORTG,1)
// PORTG<RG2>
extern volatile __bit _DEPRECATED       RG2                 __at(0x7C32);	// @ (0xF86 * 8 + 2)
#define                                 RG2_bit             _BIT_ACCESS(PORTG,2)
// PORTG<RG3>
extern volatile __bit _DEPRECATED       RG3                 __at(0x7C33);	// @ (0xF86 * 8 + 3)
#define                                 RG3_bit             _BIT_ACCESS(PORTG,3)
// PORTG<RG4>
extern volatile __bit _DEPRECATED       RG4                 __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 RG4_bit             _BIT_ACCESS(PORTG,4)
// PORTG<RG5>
extern volatile __bit                   RG5                 __at(0x7C35);	// @ (0xF86 * 8 + 5)
#define                                 RG5_bit             _BIT_ACCESS(PORTG,5)
// PORTG<RG6>
extern volatile __bit                   RG6                 __at(0x7C36);	// @ (0xF86 * 8 + 6)
#define                                 RG6_bit             _BIT_ACCESS(PORTG,6)
// PORTG<RG7>
extern volatile __bit                   RG7                 __at(0x7C37);	// @ (0xF86 * 8 + 7)
#define                                 RG7_bit             _BIT_ACCESS(PORTG,7)
// PORTH<RH0>
extern volatile __bit _DEPRECATED       RH0                 __at(0x7C38);	// @ (0xF87 * 8 + 0)
#define                                 RH0_bit             _BIT_ACCESS(PORTH,0)
// PORTH<RH1>
extern volatile __bit _DEPRECATED       RH1                 __at(0x7C39);	// @ (0xF87 * 8 + 1)
#define                                 RH1_bit             _BIT_ACCESS(PORTH,1)
// PORTH<RH2>
extern volatile __bit _DEPRECATED       RH2                 __at(0x7C3A);	// @ (0xF87 * 8 + 2)
#define                                 RH2_bit             _BIT_ACCESS(PORTH,2)
// PORTH<RH3>
extern volatile __bit _DEPRECATED       RH3                 __at(0x7C3B);	// @ (0xF87 * 8 + 3)
#define                                 RH3_bit             _BIT_ACCESS(PORTH,3)
// PORTH<RH4>
extern volatile __bit _DEPRECATED       RH4                 __at(0x7C3C);	// @ (0xF87 * 8 + 4)
#define                                 RH4_bit             _BIT_ACCESS(PORTH,4)
// PORTH<RH5>
extern volatile __bit _DEPRECATED       RH5                 __at(0x7C3D);	// @ (0xF87 * 8 + 5)
#define                                 RH5_bit             _BIT_ACCESS(PORTH,5)
// PORTH<RH6>
extern volatile __bit _DEPRECATED       RH6                 __at(0x7C3E);	// @ (0xF87 * 8 + 6)
#define                                 RH6_bit             _BIT_ACCESS(PORTH,6)
// PORTH<RH7>
extern volatile __bit _DEPRECATED       RH7                 __at(0x7C3F);	// @ (0xF87 * 8 + 7)
#define                                 RH7_bit             _BIT_ACCESS(PORTH,7)
// RCON<RI>
extern volatile __bit                   RI                  __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 RI_bit              _BIT_ACCESS(RCON,4)
// PORTJ<RJ0>
extern volatile __bit _DEPRECATED       RJ0                 __at(0x7C40);	// @ (0xF88 * 8 + 0)
#define                                 RJ0_bit             _BIT_ACCESS(PORTJ,0)
// PORTJ<RJ1>
extern volatile __bit _DEPRECATED       RJ1                 __at(0x7C41);	// @ (0xF88 * 8 + 1)
#define                                 RJ1_bit             _BIT_ACCESS(PORTJ,1)
// PORTJ<RJ2>
extern volatile __bit _DEPRECATED       RJ2                 __at(0x7C42);	// @ (0xF88 * 8 + 2)
#define                                 RJ2_bit             _BIT_ACCESS(PORTJ,2)
// PORTJ<RJ3>
extern volatile __bit _DEPRECATED       RJ3                 __at(0x7C43);	// @ (0xF88 * 8 + 3)
#define                                 RJ3_bit             _BIT_ACCESS(PORTJ,3)
// PORTJ<RJ4>
extern volatile __bit _DEPRECATED       RJ4                 __at(0x7C44);	// @ (0xF88 * 8 + 4)
#define                                 RJ4_bit             _BIT_ACCESS(PORTJ,4)
// PORTJ<RJ5>
extern volatile __bit _DEPRECATED       RJ5                 __at(0x7C45);	// @ (0xF88 * 8 + 5)
#define                                 RJ5_bit             _BIT_ACCESS(PORTJ,5)
// PORTJ<RJ6>
extern volatile __bit _DEPRECATED       RJ6                 __at(0x7C46);	// @ (0xF88 * 8 + 6)
#define                                 RJ6_bit             _BIT_ACCESS(PORTJ,6)
// PORTJ<RJ7>
extern volatile __bit _DEPRECATED       RJ7                 __at(0x7C47);	// @ (0xF88 * 8 + 7)
#define                                 RJ7_bit             _BIT_ACCESS(PORTJ,7)
// PORTG<RJPU>
extern volatile __bit _DEPRECATED       RJPU                __at(0x7C35);	// @ (0xF86 * 8 + 5)
#define                                 RJPU_bit            _BIT_ACCESS(PORTG,5)
// SSPCON2<RSEN>
extern volatile __bit                   RSEN                __at(0x7E29);	// @ (0xFC5 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSPCON2,1)
// SSPCON2<RSEN1>
extern volatile __bit                   RSEN1               __at(0x7E29);	// @ (0xFC5 * 8 + 1)
#define                                 RSEN1_bit           _BIT_ACCESS(SSPCON2,1)
// SSPSTAT<RW>
extern volatile __bit                   RW                  __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 RW_bit              _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<RW1>
extern volatile __bit                   RW1                 __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 RW1_bit             _BIT_ACCESS(SSPSTAT,2)
// PORTC<RX1>
extern volatile __bit                   RX1                 __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 RX1_bit             _BIT_ACCESS(PORTC,7)
// PORTG<RX2>
extern volatile __bit                   RX2                 __at(0x7C32);	// @ (0xF86 * 8 + 2)
#define                                 RX2_bit             _BIT_ACCESS(PORTG,2)
// RCSTA1<RX9>
extern volatile __bit _DEPRECATED       RX9                 __at(0x7D5E);	// @ (0xFAB * 8 + 6)
#define                                 RX9_bit             _BIT_ACCESS(RCSTA1,6)
// RCSTA1<RX91>
extern volatile __bit                   RX91                __at(0x7D5E);	// @ (0xFAB * 8 + 6)
#define                                 RX91_bit            _BIT_ACCESS(RCSTA1,6)
// RCSTA2<RX92>
extern volatile __bit                   RX92                __at(0x7B06);	// @ (0xF60 * 8 + 6)
#define                                 RX92_bit            _BIT_ACCESS(RCSTA2,6)
// RCSTA1<RX9D>
extern volatile __bit _DEPRECATED       RX9D                __at(0x7D58);	// @ (0xFAB * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RCSTA1,0)
// RCSTA1<RX9D1>
extern volatile __bit                   RX9D1               __at(0x7D58);	// @ (0xFAB * 8 + 0)
#define                                 RX9D1_bit           _BIT_ACCESS(RCSTA1,0)
// RCSTA2<RX9D2>
extern volatile __bit                   RX9D2               __at(0x7B00);	// @ (0xF60 * 8 + 0)
#define                                 RX9D2_bit           _BIT_ACCESS(RCSTA2,0)
// PIE3<RXB1IE>
extern volatile __bit                   RXB1IE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 RXB1IE_bit          _BIT_ACCESS(PIE3,1)
// PIE3<RXBNIE>
extern volatile __bit                   RXBNIE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 RXBNIE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<RXBNIF>
extern volatile __bit                   RXBNIF              __at(0x7D21);	// @ (0xFA4 * 8 + 1)
#define                                 RXBNIF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<RXBNIP>
extern volatile __bit                   RXBNIP              __at(0x7D29);	// @ (0xFA5 * 8 + 1)
#define                                 RXBNIP_bit          _BIT_ACCESS(IPR3,1)
// BAUDCON1<RXDTP>
extern volatile __bit                   RXDTP               __at(0x7BF5);	// @ (0xF7E * 8 + 5)
#define                                 RXDTP_bit           _BIT_ACCESS(BAUDCON1,5)
// BAUDCON1<RXDTP1>
extern volatile __bit                   RXDTP1              __at(0x7BF5);	// @ (0xF7E * 8 + 5)
#define                                 RXDTP1_bit          _BIT_ACCESS(BAUDCON1,5)
// SSPSTAT<R_NOT_W>
extern volatile __bit                   R_NOT_W             __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_NOT_W_bit         _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<R_W>
extern volatile __bit                   R_W                 __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_W_bit             _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<R_nW>
extern volatile __bit                   R_nW                __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSPSTAT,2)
// LCDDATA0<S00C0>
extern volatile __bit                   S00C0               __at(0x7DD8);	// @ (0xFBB * 8 + 0)
#define                                 S00C0_bit           _BIT_ACCESS(LCDDATA0,0)
// LCDDATA6<S00C1>
extern volatile __bit                   S00C1               __at(0x7B60);	// @ (0xF6C * 8 + 0)
#define                                 S00C1_bit           _BIT_ACCESS(LCDDATA6,0)
// LCDDATA12<S00C2>
extern volatile __bit                   S00C2               __at(0x7B90);	// @ (0xF72 * 8 + 0)
#define                                 S00C2_bit           _BIT_ACCESS(LCDDATA12,0)
// LCDDATA18<S00C3>
extern volatile __bit                   S00C3               __at(0x7BC0);	// @ (0xF78 * 8 + 0)
#define                                 S00C3_bit           _BIT_ACCESS(LCDDATA18,0)
// LCDDATA0<S01C0>
extern volatile __bit                   S01C0               __at(0x7DD9);	// @ (0xFBB * 8 + 1)
#define                                 S01C0_bit           _BIT_ACCESS(LCDDATA0,1)
// LCDDATA6<S01C1>
extern volatile __bit                   S01C1               __at(0x7B61);	// @ (0xF6C * 8 + 1)
#define                                 S01C1_bit           _BIT_ACCESS(LCDDATA6,1)
// LCDDATA12<S01C2>
extern volatile __bit                   S01C2               __at(0x7B91);	// @ (0xF72 * 8 + 1)
#define                                 S01C2_bit           _BIT_ACCESS(LCDDATA12,1)
// LCDDATA18<S01C3>
extern volatile __bit                   S01C3               __at(0x7BC1);	// @ (0xF78 * 8 + 1)
#define                                 S01C3_bit           _BIT_ACCESS(LCDDATA18,1)
// LCDDATA0<S02C0>
extern volatile __bit                   S02C0               __at(0x7DDA);	// @ (0xFBB * 8 + 2)
#define                                 S02C0_bit           _BIT_ACCESS(LCDDATA0,2)
// LCDDATA6<S02C1>
extern volatile __bit                   S02C1               __at(0x7B62);	// @ (0xF6C * 8 + 2)
#define                                 S02C1_bit           _BIT_ACCESS(LCDDATA6,2)
// LCDDATA12<S02C2>
extern volatile __bit                   S02C2               __at(0x7B92);	// @ (0xF72 * 8 + 2)
#define                                 S02C2_bit           _BIT_ACCESS(LCDDATA12,2)
// LCDDATA18<S02C3>
extern volatile __bit                   S02C3               __at(0x7BC2);	// @ (0xF78 * 8 + 2)
#define                                 S02C3_bit           _BIT_ACCESS(LCDDATA18,2)
// LCDDATA0<S03C0>
extern volatile __bit                   S03C0               __at(0x7DDB);	// @ (0xFBB * 8 + 3)
#define                                 S03C0_bit           _BIT_ACCESS(LCDDATA0,3)
// LCDDATA6<S03C1>
extern volatile __bit                   S03C1               __at(0x7B63);	// @ (0xF6C * 8 + 3)
#define                                 S03C1_bit           _BIT_ACCESS(LCDDATA6,3)
// LCDDATA12<S03C2>
extern volatile __bit                   S03C2               __at(0x7B93);	// @ (0xF72 * 8 + 3)
#define                                 S03C2_bit           _BIT_ACCESS(LCDDATA12,3)
// LCDDATA18<S03C3>
extern volatile __bit                   S03C3               __at(0x7BC3);	// @ (0xF78 * 8 + 3)
#define                                 S03C3_bit           _BIT_ACCESS(LCDDATA18,3)
// LCDDATA0<S04C0>
extern volatile __bit                   S04C0               __at(0x7DDC);	// @ (0xFBB * 8 + 4)
#define                                 S04C0_bit           _BIT_ACCESS(LCDDATA0,4)
// LCDDATA6<S04C1>
extern volatile __bit                   S04C1               __at(0x7B64);	// @ (0xF6C * 8 + 4)
#define                                 S04C1_bit           _BIT_ACCESS(LCDDATA6,4)
// LCDDATA12<S04C2>
extern volatile __bit                   S04C2               __at(0x7B94);	// @ (0xF72 * 8 + 4)
#define                                 S04C2_bit           _BIT_ACCESS(LCDDATA12,4)
// LCDDATA18<S04C3>
extern volatile __bit                   S04C3               __at(0x7BC4);	// @ (0xF78 * 8 + 4)
#define                                 S04C3_bit           _BIT_ACCESS(LCDDATA18,4)
// LCDDATA0<S05C0>
extern volatile __bit                   S05C0               __at(0x7DDD);	// @ (0xFBB * 8 + 5)
#define                                 S05C0_bit           _BIT_ACCESS(LCDDATA0,5)
// LCDDATA6<S05C1>
extern volatile __bit                   S05C1               __at(0x7B65);	// @ (0xF6C * 8 + 5)
#define                                 S05C1_bit           _BIT_ACCESS(LCDDATA6,5)
// LCDDATA12<S05C2>
extern volatile __bit                   S05C2               __at(0x7B95);	// @ (0xF72 * 8 + 5)
#define                                 S05C2_bit           _BIT_ACCESS(LCDDATA12,5)
// LCDDATA18<S05C3>
extern volatile __bit                   S05C3               __at(0x7BC5);	// @ (0xF78 * 8 + 5)
#define                                 S05C3_bit           _BIT_ACCESS(LCDDATA18,5)
// LCDDATA0<S06C0>
extern volatile __bit                   S06C0               __at(0x7DDE);	// @ (0xFBB * 8 + 6)
#define                                 S06C0_bit           _BIT_ACCESS(LCDDATA0,6)
// LCDDATA6<S06C1>
extern volatile __bit                   S06C1               __at(0x7B66);	// @ (0xF6C * 8 + 6)
#define                                 S06C1_bit           _BIT_ACCESS(LCDDATA6,6)
// LCDDATA12<S06C2>
extern volatile __bit                   S06C2               __at(0x7B96);	// @ (0xF72 * 8 + 6)
#define                                 S06C2_bit           _BIT_ACCESS(LCDDATA12,6)
// LCDDATA18<S06C3>
extern volatile __bit                   S06C3               __at(0x7BC6);	// @ (0xF78 * 8 + 6)
#define                                 S06C3_bit           _BIT_ACCESS(LCDDATA18,6)
// LCDDATA0<S07C0>
extern volatile __bit                   S07C0               __at(0x7DDF);	// @ (0xFBB * 8 + 7)
#define                                 S07C0_bit           _BIT_ACCESS(LCDDATA0,7)
// LCDDATA6<S07C1>
extern volatile __bit                   S07C1               __at(0x7B67);	// @ (0xF6C * 8 + 7)
#define                                 S07C1_bit           _BIT_ACCESS(LCDDATA6,7)
// LCDDATA12<S07C2>
extern volatile __bit                   S07C2               __at(0x7B97);	// @ (0xF72 * 8 + 7)
#define                                 S07C2_bit           _BIT_ACCESS(LCDDATA12,7)
// LCDDATA18<S07C3>
extern volatile __bit                   S07C3               __at(0x7BC7);	// @ (0xF78 * 8 + 7)
#define                                 S07C3_bit           _BIT_ACCESS(LCDDATA18,7)
// LCDDATA1<S08C0>
extern volatile __bit                   S08C0               __at(0x7DE0);	// @ (0xFBC * 8 + 0)
#define                                 S08C0_bit           _BIT_ACCESS(LCDDATA1,0)
// LCDDATA7<S08C1>
extern volatile __bit                   S08C1               __at(0x7B68);	// @ (0xF6D * 8 + 0)
#define                                 S08C1_bit           _BIT_ACCESS(LCDDATA7,0)
// LCDDATA13<S08C2>
extern volatile __bit                   S08C2               __at(0x7B98);	// @ (0xF73 * 8 + 0)
#define                                 S08C2_bit           _BIT_ACCESS(LCDDATA13,0)
// LCDDATA19<S08C3>
extern volatile __bit                   S08C3               __at(0x7BC8);	// @ (0xF79 * 8 + 0)
#define                                 S08C3_bit           _BIT_ACCESS(LCDDATA19,0)
// LCDDATA1<S09C0>
extern volatile __bit                   S09C0               __at(0x7DE1);	// @ (0xFBC * 8 + 1)
#define                                 S09C0_bit           _BIT_ACCESS(LCDDATA1,1)
// LCDDATA7<S09C1>
extern volatile __bit                   S09C1               __at(0x7B69);	// @ (0xF6D * 8 + 1)
#define                                 S09C1_bit           _BIT_ACCESS(LCDDATA7,1)
// LCDDATA13<S09C2>
extern volatile __bit                   S09C2               __at(0x7B99);	// @ (0xF73 * 8 + 1)
#define                                 S09C2_bit           _BIT_ACCESS(LCDDATA13,1)
// LCDDATA19<S09C3>
extern volatile __bit                   S09C3               __at(0x7BC9);	// @ (0xF79 * 8 + 1)
#define                                 S09C3_bit           _BIT_ACCESS(LCDDATA19,1)
// LCDDATA0<S0C0>
extern volatile __bit                   S0C0                __at(0x7DD8);	// @ (0xFBB * 8 + 0)
